app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    #@line_item = @cart.line_items.build
    #@line_item.product = product
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 28 Nov 2012 18:47:45 UTC +00:00], ["updated_at", Wed, 28 Nov 2012 18:47:45 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 980190963], ["created_at", Tue, 04 Dec 2012 15:55:34 UTC +00:00], ["order_id", nil], ["product_id", 766361120], ["quantity", 1], ["updated_at", Tue, 04 Dec 2012 15:55:34 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-11-29 02:08:26.118372' WHERE "line_items"."id" = 1