app/controllers/orders_controller.rb

  def index
    @orders = Order.paginate page: params[:page], order: 'created_at desc',
      per_page: 10
---
SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0

  def new

    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 980190963

  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 04 Dec 2012 20:10:09 UTC +00:00], ["updated_at", Tue, 04 Dec 2012 20:10:09 UTC +00:00]]
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190963]]

  def update
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "980190962"]]