app/controllers/products_controller.rb

SELECT "products".* FROM "products" LIMIT 7 OFFSET 0
---
  def index
    @products = Product.paginate page: params[:page],
      per_page: 7

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = 980190962
---
  def show
    @product = Product.find(params[:id])
    @reviews = Review.where(:product_id => params[:id])

INSERT INTO "products" ("amount_online", "amount_store", "category", "created_at", "description", "featured", "id", "image_url", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "products" SET "featured" = 0, "title" = 'Lorem Ipsum', "description" = 'Wibbles are fun!', "image_url" = 'lorem.jpg', "price" = 19.95, "amount_online" = 2, "amount_store" = 2, "category" = 'Pony', "updated_at" = '2012-11-29 01:35:50.318491' WHERE "products"."id" = 980190962
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])