app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @review = Review.find(params[:id])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @review = Review.find(params[:id])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 980190962]]
---
  def destroy
    @review = Review.find(params[:id])
    @review.destroy