app/controllers/store_controller.rb

SELECT "products".* FROM "products" WHERE "products"."featured" = 1 LIMIT 7 OFFSET 0
---
  def index
    @cart = current_cart
    @products = Product.where(:featured => true).paginate page: params[:page], per_page: 7