app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY name
---
  def index
    @users = User.order(:name)

INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "980190962"]]
UPDATE "users" SET "name" = 'sam', "password_digest" = '$2a$10$AK/t3c9XdUq7DVsiXCaheeC4DO4LDSRQkpZxPYvQ6CEiAKYFSvGq.', "updated_at" = '2012-12-06 16:23:12.566066' WHERE "users"."id" = 980190962
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 980190962]]
---
  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy